; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city18)
	(fuel-level plane1 fl3)
	(at plane2 city14)
	(fuel-level plane2 fl1)
	(at plane3 city13)
	(fuel-level plane3 fl3)
	(at person1 city4)
	(at person2 city20)
	(at person3 city10)
	(at person4 city3)
	(at person5 city6)
	(at person6 city20)
	(at person7 city1)
	(at person8 city20)
	(at person9 city3)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city1)
	(at person2 city13)
	(at person3 city5)
	(at person4 city10)
	(at person5 city0)
	(at person6 city19)
	(at person8 city4)
	(at person9 city19)
	))

)

; plan
1. (zoom plane1 city18 city10 fl3 fl2 fl1)
   deleted: (at plane1 city18) (fuel-level plane1 fl3)
   added: (at plane1 city10) (fuel-level plane1 fl1)
   goals met: 0 of 8
2. (board person3 plane1 city10)
   deleted: (at person3 city10)
   added: (in person3 plane1)
   goals met: 0 of 8
3. (fly plane1 city10 city5 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 0 of 8
4. (debark person3 plane1 city5)
   deleted: (in person3 plane1)
   added: (at person3 city5)
   goals met: 1 of 8
5. (fly plane2 city14 city20 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city20) (fuel-level plane2 fl0)
   goals met: 1 of 8
6. (zoom plane3 city13 city3 fl3 fl2 fl1)
   deleted: (at plane3 city13) (fuel-level plane3 fl3)
   added: (at plane3 city3) (fuel-level plane3 fl1)
   goals met: 1 of 8
7. (board person9 plane3 city3)
   deleted: (at person9 city3)
   added: (in person9 plane3)
   goals met: 1 of 8
8. (board person4 plane3 city3)
   deleted: (at person4 city3)
   added: (in person4 plane3)
   goals met: 1 of 8
9. (board person8 plane2 city20)
   deleted: (at person8 city20)
   added: (in person8 plane2)
   goals met: 1 of 8
10. (refuel plane2 city20 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 1 of 8
11. (board person6 plane2 city20)
   deleted: (at person6 city20)
   added: (in person6 plane2)
   goals met: 1 of 8
12. (board person2 plane2 city20)
   deleted: (at person2 city20)
   added: (in person2 plane2)
   goals met: 1 of 8
13. (fly plane3 city3 city10 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 1 of 8
14. (refuel plane3 city10 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 1 of 8
15. (debark person4 plane3 city10)
   deleted: (in person4 plane3)
   added: (at person4 city10)
   goals met: 2 of 8
16. (fly plane3 city10 city19 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city19) (fuel-level plane3 fl0)
   goals met: 2 of 8
17. (debark person9 plane3 city19)
   deleted: (in person9 plane3)
   added: (at person9 city19)
   goals met: 3 of 8
18. (fly plane2 city20 city4 fl1 fl0)
   deleted: (at plane2 city20) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 3 of 8
19. (refuel plane3 city19 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 8
20. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 8
21. (debark person8 plane2 city4)
   deleted: (in person8 plane2)
   added: (at person8 city4)
   goals met: 4 of 8
22. (board person1 plane2 city4)
   deleted: (at person1 city4)
   added: (in person1 plane2)
   goals met: 4 of 8
23. (fly plane3 city19 city6 fl1 fl0)
   deleted: (at plane3 city19) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 4 of 8
24. (board person5 plane3 city6)
   deleted: (at person5 city6)
   added: (in person5 plane3)
   goals met: 4 of 8
25. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 8
26. (fly plane3 city6 city0 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 4 of 8
27. (debark person5 plane3 city0)
   deleted: (in person5 plane3)
   added: (at person5 city0)
   goals met: 5 of 8
28. (fly plane2 city4 city1 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 5 of 8
29. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 8
30. (debark person1 plane2 city1)
   deleted: (in person1 plane2)
   added: (at person1 city1)
   goals met: 6 of 8
31. (fly plane2 city1 city13 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 6 of 8
32. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 8
33. (debark person2 plane2 city13)
   deleted: (in person2 plane2)
   added: (at person2 city13)
   goals met: 7 of 8
34. (fly plane2 city13 city19 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city19) (fuel-level plane2 fl0)
   goals met: 7 of 8
35. (debark person6 plane2 city19)
   deleted: (in person6 plane2)
   added: (at person6 city19)
   goals met: 8 of 8
